podonoghue/usbdm-eclipse-makefiles-build-4.10.6.250/PackageFiles/DeviceData/Device.SVD/peripherals/UART0_C7816_MK64M12.svd.xml
            <register>
               <name>PFIFO</name>
               <description>UART FIFO Parameters</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXFIFOSIZE</name>
                     <description>Receive FIFO. Buffer Depth</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Receive FIFO/Buffer Depth = 1 Dataword</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Receive FIFO/Buffer Depth = 4 Datawords</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Receive FIFO/Buffer Depth = 8 Datawords</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Receive FIFO/Buffer Depth = 16 Datawords</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Receive FIFO/Buffer Depth = 32 Datawords</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Receive FIFO/Buffer Depth = 64 Datawords</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Receive FIFO/Buffer Depth = 128 Datawords</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Reserved</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXFE</name>
                     <description>Receive FIFO Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Receive FIFO is not enabled. Buffer is depth 1. (Legacy support)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Receive FIFO is enabled. Buffer is depth indicted by RXFIFOSIZE</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFIFOSIZE</name>
                     <description>Transmit FIFO. Buffer Depth</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Transmit FIFO/Buffer Depth = 1 Dataword</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Transmit FIFO/Buffer Depth = 4 Datawords</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Transmit FIFO/Buffer Depth = 8 Datawords</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Transmit FIFO/Buffer Depth = 16 Datawords</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Transmit FIFO/Buffer Depth = 32 Datawords</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Transmit FIFO/Buffer Depth = 64 Datawords</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Transmit FIFO/Buffer Depth = 128 Datawords</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Reserved</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFE</name>
                     <description>Transmit FIFO Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Transmit FIFO is not enabled. Buffer is depth 1. (Legacy support)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transmit FIFO is enabled. Buffer is depth indicated by TXFIFOSIZE</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFIFO</name>
               <description>UART FIFO Control Register</description>
               <addressOffset>0x11</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXUFE</name>
                     <description>Receive FIFO Underflow Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>RXUF flag does not generate an interrupt to the host</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>RXUF flag generates an interrupt to the host</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXOFE</name>
                     <description>Transmit FIFO Overflow Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TXOF flag does not generate an interrupt to the host</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TXOF flag generates an interrupt to the host</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXOFE</name>
                     <description>Receive FIFO Overflow Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>RXOF flag does not generate an interrupt to the host</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>RXOF flag generates an interrupt to the host</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXFLUSH</name>
                     <description>Receive FIFO/Buffer Flush</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No flush operation occurs</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>All data in the receive FIFO/buffer is cleared out</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXFLUSH</name>
                     <description>Transmit FIFO/Buffer Flush</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No flush operation occurs</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>All data in the transmit FIFO/Buffer is cleared out</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFIFO</name>
               <description>UART FIFO Status Register</description>
               <addressOffset>0x12</addressOffset>
               <size>8</size>
               <resetValue>0xC0</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXUF</name>
                     <description>Receiver Buffer Underflow Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No receive buffer underflow has occurred since the last time the flag was cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>At least one receive buffer underflow has occurred since the last time the flag was cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXOF</name>
                     <description>Transmitter Buffer Overflow Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No transmit buffer overflow has occurred since the last time the flag was cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>At least one transmit buffer overflow has occurred since the last time the flag was cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXOF</name>
                     <description>Receiver Buffer Overflow Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No receive buffer overflow has occurred since the last time the flag was cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>At least one receive buffer overflow has occurred since the last time the flag was cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXEMPT</name>
                     <description>Receive Buffer/FIFO Empty</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Receive buffer is not empty</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Receive buffer is empty</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXEMPT</name>
                     <description>Transmit Buffer/FIFO Empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Transmit buffer is not empty</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transmit buffer is empty</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TWFIFO</name>
               <description>UART FIFO Transmit Watermark</description>
               <addressOffset>0x13</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TXWATER</name>
                     <description>Transmit Watermark</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCFIFO</name>
               <description>UART FIFO Transmit Count</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TXCOUNT</name>
                     <description>Transmit Counter</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>RWFIFO</name>
               <description>UART FIFO Receive Watermark</description>
               <addressOffset>0x15</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXWATER</name>
                     <description>Receive Watermark</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCFIFO</name>
               <description>UART FIFO Receive Count</description>
               <addressOffset>0x16</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXCOUNT</name>
                     <description>Receive Counter</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
