podonoghue/usbdm-eclipse-makefiles-build-4.10.6.250/PackageFiles/DeviceData/Device.SVD/peripherals/UART0_C7816_MK64M12.svd.xml
            <register>
               <name>C7816</name>
               <description>UART 7816 Control Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ISO_7816E</name>
                     <description>ISO-7816 Functionality Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ISO-7816 functionality is turned off / not enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ISO-7816 functionality is turned on / enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTYPE</name>
                     <description>Transfer Type</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>T = 0 Per the ISO-7816 specification</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>T = 1 Per the ISO-7816 specification</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INIT</name>
                     <description>Detect Initial Character</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operating mode. Receiver does not seek to identify initial character</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Receiver searches for initial character</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANACK</name>
                     <description>Generate NACK on Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No NACK is automatically generated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A NACK is automatically generated if a parity error is detected or if an invalid initial character is detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONACK</name>
                     <description>Generate NACK on Overflow</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The received data does not generate a NACK when the receipt of the data results in an overflow event</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>If the receiver buffer overflows, a NACK is automatically sent on a received character</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IE7816</name>
               <description>UART 7816 Interrupt Enable Register</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXTE</name>
                     <description>Receive Threshold Exceeded Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[RXT] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[RXT] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXTE</name>
                     <description>Transmit Threshold Exceeded Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[TXT] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[TXT] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GTVE</name>
                     <description>Guard Timer Violated Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[GTV] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[GTV] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INITDE</name>
                     <description>Initial Character Detected Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[INITD] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[INITD] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BWTE</name>
                     <description>Block Wait Timer Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[BWT] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[BWT] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CWTE</name>
                     <description>Character Wait Timer Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[CWT] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[CWT] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WTE</name>
                     <description>Wait Timer Interrupt Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The assertion of the IS7816[WT] bit will not result in the generation of an interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The assertion of the IS7816[WT] bit will result in the generation of an interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IS7816</name>
               <description>UART 7816 Interrupt Status Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXT</name>
                     <description>Receive Threshold Exceeded Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The number of consecutive NACKS generated as a result of parity errors and buffer overruns is less than or equal to the value in ET7816[RXTHRESHOLD]</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The number of consecutive NACKS generated as a result of parity errors and buffer overruns is greater than the value in ET7816[RXTHRESHOLD]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXT</name>
                     <description>Transmit Threshold Exceeded Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The number of retries and corresponding NACKS does not exceed the value in the ET7816[TXTHRESHOLD] field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The number of retries and corresponding NACKS exceeds the value in the ET7816[TXTHRESHOLD] field</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GTV</name>
                     <description>Guard Timer Violated Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A guard time (GT, CGT or BGT) has not been violated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A guard time (GT, CGT or BGT) has been violated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INITD</name>
                     <description>Initial Character Detected Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A valid initial character has not been received</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A valid initial character has been received</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BWT</name>
                     <description>Block Wait Timer Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Block wait time (BWT) has not been violated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Block wait Time (BWT) has been violated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CWT</name>
                     <description>Character Wait Timer Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Character wait time (CWT) has not been violated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Character wait time (CWT) has been violated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WT</name>
                     <description>Wait Timer Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Wait time (WT) has not been violated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wait time (WT) has been violated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816T0</name>
               <description>UART 7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WI</name>
                     <description>Wait Timer Interrupt (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816T1</name>
               <description>UART 7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BWI</name>
                     <description>Block Wait Time Integer(C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CWI</name>
                     <description>Character Wait Time Integer (C7816[TTYPE] = 1)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WN7816</name>
               <description>UART 7816 Wait N Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTN</name>
                     <description>Guard Band N</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WF7816</name>
               <description>UART 7816 Wait FD Register</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTFD</name>
                     <description>FD Multiplier</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ET7816</name>
               <description>UART 7816 Error Threshold Register</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXTHRESHOLD</name>
                     <description>Receive NACK Threshold
The value written to this field indicates the maximum number of consecutive NACKs generated as a result
of a parity error or receiver buffer overruns before the host processor is notified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXTHRESHOLD</name>
                     <description>Transmit NACK Threshold
The value written to this field indicates the maximum number of failed attempts (NACKs) a transmitted
character can have before the host processor is notified</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TL7816</name>
               <description>UART 7816 Transmit Length Register</description>
               <addressOffset>0x1F</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TLEN</name>
                     <description>Transmit Length</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
